# # Задача 1. Просто формула
# a = 8
# b = 10
# c = 12
# d = 18

# res = ((-3 + a**2) * b - 2**3)/(c-2*d)
# print('Задача 1. res = ', res)

# # Задача 2. Часы
# print('Задача 2.') 
# n = int(input('Введите коливество минут:'))
# hour = n//60
# min = n % 60
# print('Вы ввели:', n, ',это - ')
# print(hour, 'час.')
# print('И', min, 'мин.')

# # Задача 3. Билет
# print('Задача 3.')
# b = str(input('Введите свой шестизначный номер билета:'))
# one = b [0]
# two = b [1]
# three = b [2]
# four = b [3]
# five = b [4]
# six = b [5]

# first = (int(one)+int(two)+int(three))
# second = (int(four)+int(six)+int(five))

# if first == second:  
#     print('Билет счастливый, ура!')
# else: 
#     print ('Обычный билет(')

# # Задача 4. Площадь прямоугольного треуголника
# print('Задача 4.')
# a = int(input('Длина катета а = '))
# b = int(input('Длина катета b = '))
# s = (a*b)/2
# print('Площадь треугольника равна:', s)

# Задача 4. Поменять местами, без использования третьей переменной
print('Задача 5*.')
a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
print('Вы ввели:', a, b)
a = a+b
b = a-b
a = a-b 
print('А если поменять местами:', a, b)